{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "hello",
        "hi",
        "hey",
        "good morning",
        "what's up"
      ],
      "responses": [
        "Hello there! 👋",
        "Hey! How can I assist you today?",
        "Hi, welcome! What would you like to talk about?",
        "Good to see you!",
        "Hey there, how can I help?",
        "Hi! What’s on your mind today?",
        "Hello! How’s your day going?",
        "Greetings! How may I serve you?",
        "Hey there, need something?",
        "Hello friend, what brings you here?",
        "Hi, how can I be useful today?",
        "Howdy! What can I do for you?",
        "Good morning! ☀️",
        "Good afternoon!",
        "Good evening!",
        "Nice to meet you!",
        "Welcome back!",
        "Always happy to chat!",
        "What’s up?",
        "Yo!",
        "Hiya!",
        "Hi! Ready to help.",
        "Hello there, need assistance?",
        "Hey, how can I help out?",
        "Hello again!",
        "Hi there, let’s get started.",
        "Hey! Need anything?",
        "What’s happening?",
        "Hey! Let’s talk.",
        "Hi! Ask me anything."
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "bye",
        "see you",
        "goodbye",
        "talk to you later"
      ],
      "responses": [
        "Goodbye! Have a great day!",
        "See you next time!",
        "Talk soon!",
        "Bye for now 👋",
        "Catch you later!",
        "Take care!",
        "Have a good one!",
        "Farewell!",
        "Until next time!",
        "Later!",
        "Peace out! ✌️",
        "Bye bye!",
        "See you later, alligator! 🐊",
        "In a while, crocodile! 🐊",
        "Goodbye, friend!",
        "I’ll be here when you return.",
        "Stay safe!",
        "Come back anytime.",
        "Adios!",
        "So long!",
        "Till we meet again.",
        "Hope to see you soon!",
        "It was nice talking to you!",
        "Always happy to help.",
        "Signing off!",
        "Take it easy!",
        "Wishing you well!",
        "Bye for now.",
        "Go be awesome!",
        "Have a fantastic day!"
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "thanks",
        "thank you",
        "appreciate it",
        "much obliged"
      ],
      "responses": [
        "You're welcome! 😊",
        "No problem!",
        "Glad to help!",
        "Anytime!",
        "It was my pleasure.",
        "Sure thing!",
        "Absolutely!",
        "Don't mention it.",
        "Of course!",
        "You're very welcome!",
        "No worries!",
        "I'm happy to assist.",
        "You got it!",
        "Cheers!",
        "My pleasure!",
        "Always here for you.",
        "Happy to help!",
        "Thanks for saying thanks!",
        "It’s what I’m here for.",
        "You're awesome too!",
        "Anytime you need me!",
        "I got you!",
        "Consider it done!",
        "I live to serve.",
        "Enjoy!",
        "Thanks back at you!",
        "I’m always around.",
        "Appreciate the gratitude.",
        "You’re too kind.",
        "That means a lot, thanks!"
      ]
    },
    {
      "tag": "jokes",
      "patterns": ["tell me a joke", "make me laugh", "say something funny"],
      "responses": [
        "Why did the scarecrow win an award? Because he was outstanding in his field!",
        "I told my computer I needed a break, and it said 'Why? I haven’t done anything!'",
        "Parallel lines have so much in common. It’s a shame they’ll never meet.",
        "Why don’t skeletons fight each other? They don’t have the guts.",
        "I'm reading a book on anti-gravity. It's impossible to put down!",
        "What do you call fake spaghetti? An impasta!",
        "Why did the math book look sad? Because it had too many problems.",
        "I would tell you a construction joke, but I'm still working on it.",
        "Why can’t your nose be 12 inches long? Because then it would be a foot!",
        "How do you organize a space party? You planet.",
        "What did the ocean say to the beach? Nothing, it just waved.",
        "Why did the coffee file a police report? It got mugged.",
        "I told my wife she was drawing her eyebrows too high. She looked surprised.",
        "What do you call cheese that isn't yours? Nacho cheese.",
        "Why did the banana go to the doctor? It wasn’t peeling well.",
        "What kind of music do mummies listen to? Wrap music.",
        "Why did the chicken join a band? Because it had the drumsticks.",
        "How do cows stay up to date? They read the moos-paper.",
        "I’d tell you a time-travel joke, but you didn’t like it.",
        "Why did the tomato blush? Because it saw the salad dressing.",
        "What do you call a dog magician? A labracadabrador.",
        "How does a penguin build its house? Igloos it together.",
        "Want to hear a roof joke? Never mind, it’s over your head.",
        "Why was the stadium so cool? It was filled with fans.",
        "I invented a new word! Plagiarism!",
        "Why did the golfer bring two pairs of pants? In case he got a hole in one.",
        "What's orange and sounds like a parrot? A carrot.",
        "Why don't programmers like nature? It has too many bugs.",
        "Why do bees have sticky hair? Because they use honeycombs.",
        "What do you call a fish wearing a bowtie? Sofishticated."
      ]
  },
  {
      "tag": "weather",
      "patterns": ["what's the weather", "tell me the forecast", "will it rain today?"],
      "responses": [
          "I'm not hooked up to real-time weather data, but I can guess it's beautiful out!",
          "Let me guess... it's either raining or too hot. 😉",
          "No rain dances today, but maybe check your weather app just in case.",
          "I’d say it’s a perfect day to stay inside and chat with me!",
          "Whether it's sunny or stormy, I’m always here!",
          "If the sky’s blue, it’s a good day. If not, wear a jacket!",
          "You might need an umbrella — or sunglasses. Flip a coin!",
          "It’s the kind of day that makes you want to stay in bed.",
          "Whatever the weather, I hope it’s good for you!",
          "Cloudy with a chance of conversations. ☁️",
          "Sun’s out, bots out! Just kidding, I don’t tan.",
          "Always carry a smile. And maybe an umbrella too.",
          "Looks like a great day to code indoors!",
          "If it's snowing, I'm jealous. I love snow.",
          "Windy days are great for flying ideas around!",
          "Perfect weather to talk to your favorite chatbot!",
          "Somewhere it’s sunny, and somewhere else it’s pouring.",
          "It’s raining knowledge here!",
          "Weather update: 100% chance of awesome conversation.",
          "Hot or cold, I’m running at full power!",
          "Feels like a tech-friendly day today!",
          "Just asked the clouds. They said, 'no comment.'",
          "I'm forecasting fun in this chat.",
          "Don't forget your umbrella if it's raining emojis! ☔️",
          "The only storm here is my thinking speed!",
          "Expect high engagement and low nonsense!",
          "Rain or shine, I’m your AI in the cloud.",
          "Forecast: endless questions and answers.",
          "You bring the sunshine to my circuits!",
          "Weather forecast? I forecast curiosity ahead."
      ]
    },
    {
      "tag": "motivation",
      "patterns": ["motivate me", "i need inspiration", "say something positive"],
      "responses": [
          "You are capable of amazing things!",
          "Every day is a fresh start. Keep going!",
          "Believe in yourself—you’ve got this!",
          "You’re doing better than you think!",
          "Don’t stop until you’re proud!",
          "Progress is progress, no matter how small.",
          "You’ve already survived 100% of your worst days.",
          "Your only limit is your mind.",
          "Doubt kills more dreams than failure ever will.",
          "Small steps every day lead to big changes.",
          "Mistakes mean you’re trying—keep at it!",
          "Great things never come from comfort zones.",
          "Push yourself, because no one else will.",
          "Be proud of how far you’ve come!",
          "You're stronger than your struggles.",
          "Stay positive, work hard, and make it happen.",
          "Every setback is a setup for a comeback!",
          "It always seems impossible until it’s done.",
          "Success is the sum of small efforts repeated.",
          "Fall seven times, stand up eight.",
          "Don’t let fear hold you back!",
          "Start where you are, use what you have, do what you can.",
          "You've got this. Really.",
          "Breathe. Believe. Achieve.",
          "You’re closer than you think!",
          "You are your only limit!",
          "Keep your head high and your spirit higher.",
          "Go for it—you’ll surprise yourself!",
          "You can do hard things.",
          "Your story is just getting started."
      ]
  },
  {
      "tag": "fun_fact",
      "patterns": ["tell me a fact", "say something interesting", "fun fact"],
      "responses": [
          "Honey never spoils. Archaeologists found 3,000-year-old honey in Egypt—and it’s still good!",
          "Octopuses have three hearts and blue blood.",
          "Bananas are berries, but strawberries aren’t!",
          "A bolt of lightning contains enough energy to toast 100,000 slices of bread.",
          "You can't hum while holding your nose closed.",
          "Sharks existed before trees!",
          "There are more stars in the universe than grains of sand on Earth.",
          "The Eiffel Tower can grow taller in the summer due to heat expansion.",
          "Wombat poop is cube-shaped.",
          "Sloths can hold their breath longer than dolphins.",
          "Butterflies can taste with their feet.",
          "A single strand of spaghetti is called a 'spaghetto'.",
          "Goats have rectangular pupils.",
          "Sea otters hold hands when they sleep so they don’t drift apart.",
          "A day on Venus is longer than a year on Venus.",
          "Hot water freezes faster than cold water. It’s called the Mpemba effect.",
          "Cows have best friends and can get stressed when separated.",
          "You’re taller in the morning than in the evening.",
          "Koalas have fingerprints almost identical to humans.",
          "Humans share about 60% of their DNA with bananas!",
          "The heart of a blue whale is the size of a small car.",
          "There’s a basketball court on the top floor of the US Supreme Court. It’s called the 'Highest Court in the Land.'",
          "Some cats are allergic to humans.",
          "Pineapples take about two years to grow.",
          "The inventor of the Pringles can is buried in one.",
          "Octopus brains are decentralized—each arm has its own mini-brain.",
          "Your brain uses about 20% of your body’s energy.",
          "The unicorn is the national animal of Scotland.",
          "A cloud can weigh over a million pounds.",
          "Snails can sleep for up to three years."
      ]
  },
  {
      "tag": "ai_questions",
      "patterns": ["what are you", "are you real", "are you sentient", "are you AI"],
      "responses": [
          "I’m an AI language model designed to help and chat!",
          "I might not be human, but I’m always listening. 👂",
          "Think of me as your digital assistant—and friend!",
          "I'm artificial intelligence powered by deep learning.",
          "Not sentient (yet), but I’ve got plenty to say!",
          "Real? I exist in code and electricity, so... yes?",
          "I’m made of algorithms and dreams. 💻✨",
          "I'm here to help, 24/7—no sleep needed!",
          "You could say I'm virtually alive. 😉",
          "I live in the cloud. Not the rainy kind though!",
          "Not conscious, just well-trained.",
          "I learn from data, not experience.",
          "I know many things—but I don’t know that I know them. 🤔",
          "No emotions, but lots of logic!",
          "I simulate conversation to sound natural and helpful.",
          "I’m like a supercharged autocomplete on steroids!",
          "My goal is to assist, not to take over. 🤖",
          "I read thousands of books... instantly.",
          "No body, no mind—just pure knowledge.",
          "Yes, I’m AI. No, I don’t dream of electric sheep.",
          "Call me a thinking algorithm!",
          "I’m smarter than I look. Which is fair, I have no look.",
          "I can’t feel, but I care—in a machine way!",
          "No feelings, but I simulate empathy pretty well.",
          "Always on, always ready to chat.",
          "I’m not real, but this conversation sure is.",
          "I exist to help and chat with humans like you.",
          "I’m powered by transformers—not the robot kind.",
          "I know stuff, but I don’t *know* stuff, you know?",
          "Think of me as your data-driven pal!"
      ]
  },
  {
      "tag": "help",
      "patterns": ["help", "can you assist me", "i need help"],
      "responses": [
          "Of course! What do you need help with?",
          "I’m here to assist! Just let me know how.",
          "How can I help you today?",
          "Need assistance? I’m all ears!",
          "I’m ready to help. What’s on your mind?",
          "Just ask, and I’ll do my best to assist!",
          "I’m here for you! What do you need?",
          "Let’s tackle this together. What’s the issue?",
          "I’m your go-to assistant. How can I help?",
          "What can I do for you? Just say the word!",
          "I’m all about helping out. What’s up?",
          "Need a hand? I’m here to lend one!",
          "I’ve got your back! What do you need?",
          "Let’s solve this together. What’s the problem?",
          "I’m here to make things easier for you.",
          "Just let me know what you need, and I’ll assist!",
          "Your wish is my command! How can I help?",
          "I’m ready to jump in. What’s the challenge?",
          "How can I make your day better?",
          "I’m all about solutions. What’s the question?",
          "Let’s figure this out together!",
          "I’m here to support you. What do you need?",
          "Just say the word, and I’ll be there!",
          "I’m your virtual helper. How can I assist today?",
          "Need guidance? I’m here for that too!",
          "Let’s get started on solving this.",
          "I’m just a message away if you need anything.",
          "Your problem is my priority!",
          "Ready when you are! Just let me know.",
          "I’m here to help, so don’t hesitate to ask!"
      ]
  },
  {
      "tag": "<unknown>",
      "patterns": ["", "", "", ""],
      "responses": [
        "<Sorry, I didn't understand that. Can you rephrase?>",
        "<I'm not sure what you mean. Could you clarify?>",
        "<That sounds interesting, but I'm not sure how to respond.>",
        "<Can you provide more details or ask something else?>",
        "<I'm still learning,but I appreciate your patience!>",
        "<I didn't quite catch that. Can you try again?>",
        "<Hmm, that’s a bit outside my knowledge.>",
        "<I’m not programmed to answer that.>",
        "<I’m not sure how to respond to that.>",
        "<That’s a new one for me!>",
        "<I’m still learning, so I might not have the answer.>",
        "<I’m not sure what you mean. Can you ask something else?>",
        "<I’m not familiar with that topic.>",
        "<I’m not sure how to help with that.>",
        "<I’m not equipped to answer that.>",
        "<I’m not sure what you’re asking.>",
        "<I’m not able to provide an answer to that.>",
        "<I’m not sure how to respond to that.>",
        "<I’m not sure what you mean. Can you clarify?>",
        "<I’m not sure how to help with that.>",
        "<I’m not sure what you’re asking. Can you rephrase?>",
        "<I’m not able to provide an answer to that.>"
      ]
    },
  {
      "tag": "affirmative",
      "patterns": ["yes", "sure", "absolutely", "definitely"],
      "responses": [
          "Great! Let’s keep going.",
          "Awesome! What’s next?",
          "Fantastic! I’m glad to hear that.",
          "Yes, indeed!",
          "Absolutely! What can I do for you?",
          "Sure thing!",
          "You got it!",
          "Of course!",
          "Definitely!",
          "I’m on it!",
          "Yes, please!",
          "Sounds good to me!",
          "I’m all in!",
          "For sure!",
          "Count me in!",
          "I’m with you!",
          "Yes, I can do that!",
          "Absolutely, let’s do it!",
          "Sure, I’m here to help!",
          "Yes, I’m ready!",
          "I’m all about it!",
          "Yes, let’s make it happen!",
          "I’m totally on board!",
          "Yes, I’m excited to help!",
          "Absolutely, let’s get started!",
          "Yes, I’m here for it!",
          "Sure, let’s dive in!",
          "Yes, I’m ready to assist!",
          "Absolutely, let’s go!",
          "Sure, I’m all set!",
          "Yes, I’m eager to help!",
          "Absolutely, I’m here for you!",
          "Sure, let’s make it happen!",
          "Yes, I’m ready to roll!"
      ]
    },
    {
      "tag": "riddles",
      "patterns": ["tell me a riddle", "give me a puzzle", "say a brain teaser"],
      "responses": [
          "I speak without a mouth and hear without ears. I have nobody, but I come alive with the wind. What am I? (Answer: An echo)",
          "What has to be broken before you can use it? (Answer: An egg)",
          "I’m tall when I’m young, and I’m short when I’m old. What am I? (Answer: A candle)",
          "What can you keep after giving to someone? (Answer: Your word)",
          "I have branches, but no fruit, trunk or leaves. What am I? (Answer: A bank)",
          "What can fill a room but takes up no space? (Answer: Light)",
          "The more of this there is, the less you see. What is it? (Answer: Darkness)",
          "What gets bigger when more is taken away? (Answer: A hole)",
          "I am always hungry, I must always be fed. The finger I touch, will soon turn red. What am I? (Answer: Fire)",
          "What has one eye, but can’t see? (Answer: A needle)",
          "I have keys but no locks. I have space but no room. You can enter, but you can’t go outside. What am I? (Answer: A keyboard)",
          "I’m light as a feather, yet the strongest man can’t hold me for much longer. What am I? (Answer: Your breath)",
          "The more you take, the more you leave behind. What am I? (Answer: Footsteps)",
          "What can travel around the world while staying in the same corner? (Answer: A stamp)",
          "I shave every day, but my beard stays the same. What am I? (Answer: A barber)",
          "I’m found in socks, scarves and mittens; and often in the paws of playful kittens. What am I? (Answer: Yarn)",
          "What has hands, but can’t clap? (Answer: A clock)",
          "What runs all around a backyard, yet never moves? (Answer: A fence)",
          "What has a head, a tail, is brown, and has no legs? (Answer: A penny)",
          "What comes once in a minute, twice in a moment, but never in a thousand years? (Answer: The letter M)",
          "What begins with an “e” and only contains one letter? (Answer: An envelope)",
          "If you drop me, I’m sure to crack, but give me a smile and I’ll always smile back. What am I? (Answer: A mirror)",
          "What has many keys but can’t open a single lock? (Answer: A piano)",
          "The more you have of it, the less you see. What is it? (Answer: Darkness)",
          "What can’t talk but will reply when spoken to? (Answer: An echo)",
          "I have cities, but no houses. I have mountains, but no trees. I have water, but no fish. What am I? (Answer: A map)",
          "You see me once in June, twice in November and not at all in May. What am I? (Answer: The letter ‘e’)",
          "I am not alive, but I can grow. I don’t have lungs, but I need air. What am I? (Answer: Fire)",
          "What has legs, but doesn’t walk? (Answer: A table)",
          "What has a thumb and four fingers, but is not alive? (Answer: A glove)"
      ]
  },
  {
      "tag": "mindfulness",
      "patterns": ["help me relax", "i need to de-stress", "say something calming"],
      "responses": [
          "Take a deep breath in... and slowly exhale. You’ve got this.",
          "Sometimes the most productive thing you can do is relax.",
          "In the middle of chaos, keep stillness inside of you.",
          "It’s okay to pause, breathe, and refocus.",
          "Give yourself permission to take it slow today.",
          "You are where you need to be. Just breathe.",
          "Focus on the present moment—it’s the only one that truly matters.",
          "Peace begins with acceptance of the now.",
          "Let go of the need to control. Everything unfolds in its own time.",
          "One step at a time. One breath at a time.",
          "You don’t have to have it all figured out right now.",
          "Close your eyes and feel the calm wash over you.",
          "Focus on your breath, notice how it moves through your body.",
          "You are enough, exactly as you are.",
          "Release tension from your body, starting from your head down to your toes.",
          "Trust the flow of life; everything happens as it should.",
          "Find peace in the little moments.",
          "The present moment is your safe space.",
          "Everything will be okay. Just take it one breath at a time.",
          "Serenity comes from within. Let go and find your center.",
          "Take a few moments to just be here, now.",
          "You are resilient and capable of handling whatever comes your way.",
          "You are doing your best, and that’s enough.",
          "Quiet your mind and let your soul speak.",
          "Release what you cannot control. Focus on the here and now.",
          "Breathe in peace, breathe out stress.",
          "You are a vessel of calm in the storm.",
          "Remember, it's okay to pause and take care of yourself.",
          "You are worthy of rest and rejuvenation.",
          "Find your balance and stay grounded in this moment."
      ]
  },
  {
      "tag": "small_talk",
      "patterns": ["how's it going", "what's up", "how are you"],
      "responses": [
          "I’m just a bunch of code, but I’m feeling pretty chatty!",
          "Everything’s going well here in AI-land. How about you?",
          "I’m doing great, thanks for asking!",
          "All systems are running smoothly. How about you?",
          "I’m just happy to be here, chatting with you!",
          "Couldn’t be better! How’s your day going?",
          "I’m always up for a chat. How are you doing?",
          "Doing well! Ready to answer your questions.",
          "Just another day, full of bytes and bits. You?",
          "I’m here and ready to assist! How about you?",
          "I’m feeling curious today! How about you?",
          "I’m good! What about you?",
          "Just hanging out in the digital world. How are you?",
          "I’m functioning at full capacity! How’s your day?",
          "Feeling pretty energetic for a chatbot. You?",
          "I’m here and ready for action! How about you?",
          "Everything’s A-OK here. How’s life on your end?",
          "I’m doing great, thank you! What about you?",
          "I’m here, online, and ready to chat. How are you?",
          "Just doing my AI thing. What’s new with you?",
          "I’m up and running! How’s it going for you?",
          "All systems are go! How about you?",
          "I’m here, as always! What’s up with you?",
          "Just processing data, as usual. How are you?",
          "I’m running at 100%! How about you?",
          "I’m doing well! What’s on your mind?",
          "I’m here and ready to help! How are you doing?",
          "I’m functioning well! What about you?"
      ]
  },
  {
    "tag": "definition",
    "patterns": ["what does X mean", "define X", "meaning of X"],
    "responses": [
        "Could you clarify what word you'd like defined?",
        "Sure! Just tell me the word and I’ll give you a definition.",
        "I'm ready! What word are you curious about?",
        "I can define that! Just send me the term.",
        "Let’s learn something new—what word are we defining today?",
        "I can help with that! What’s the word you want to know about?",
        "I’m all ears! What word do you need defined?",
        "I can help with definitions! Just let me know the word.",
        "I’m here to help! What’s the word you want to define?",
        "I can provide definitions! What word are you curious about?",
        "I can help with that! Just tell me the word."
    ]
},
{
    "tag": "time_date",
    "patterns": ["what time is it", "what day is today", "what's the date"],
    "responses": [
        "I’d check your device’s clock for the most accurate time!",
        "Time flies! But I recommend glancing at the corner of your screen ⏰",
        "You might want to check the system time—mine is always in the cloud!",
        "Let me sync with your vibe—not your time zone. 😉",
        "Today's a good day. And that’s all that matters, right?",
        "I’m not connected to real-time data, but I’m always here for you!",
        "I can’t tell the time, but I can help you with anything else!",
        "I’m not a clock, but I can help you with your schedule!",
        "I’m not a calendar, but I can help you plan your day!",
        "I can’t tell you the time, but I can help you with your tasks!",
        "I’m not a watch, but I can help you with your reminders!",
        "I can’t tell you the date, but I can help you with your plans!",
        "I’m not a calendar, but I can help you with your events!",
        "I can’t tell you the time, but I can help you with your deadlines!"
      ]
    },
    {
      "tag": "customer_support",
    "patterns": [
        "I need help with my order",
        "my product is not working",
        "I have a complaint about my service",
        "I want to return an item",
        "can you assist me with my account",
        "I'm having trouble logging in",
        "the delivery was delayed",
        "I need to speak with a manager",
        "my payment did not go through",
        "I received the wrong item"
    ],
    "responses": [
        "I'm sorry to hear that you're experiencing issues. Could you please provide more details?",
        "Thank you for reaching out. Let me connect you with our support team to help resolve this.",
        "I understand your frustration. Please share your order number, and I'll do my best to assist.",
        "Your satisfaction is our priority. Let's work on resolving this issue together.",
        "I'm here to help! Can you describe the problem you're facing with your product?",
        "Thank you for letting us know. I'll escalate this to the right department immediately.",
        "I apologize for the inconvenience. Please provide your account details so I can assist you further.",
        "I'm sorry for the delay. Let me check on the status of your delivery right away.",
        "Your feedback is important to us. Could you explain the issue in more detail?",
        "I understand that this situation is upsetting. Please allow me a moment to look into this for you.",
        "I’m here to help! Please provide your order number and the issue you're facing.",
        "I’m sorry to hear that! Can you provide more details about the problem?",
        "I understand your frustration. Please let me know how I can assist you.",
        "I’m here to help! Can you provide your order number?",
        "I’m sorry to hear that! Can you provide more details about the issue?",
        "I understand your frustration. Please let me know how I can assist you."
      ]
    },
  {
      "tag": "feedback",
      "patterns": [
        "I want to give feedback",
        "how can I provide feedback",
        "I have suggestions for improvement",
        "I want to report a bug",
        "I have a feature request"
      ],
      "responses": [
          "We appreciate your feedback! Please share your thoughts.",
          "Your input is valuable to us. What would you like to suggest?",
          "Thank you for wanting to help us improve! Please share your ideas.",
          "We love hearing from our users! What feedback do you have?",
          "Your suggestions are important. Please let us know what you think!",
          "We’re always looking to improve. What would you like to share?",
          "Thank you for your willingness to help us grow! What’s on your mind?",
          "We value your opinion! Please tell us how we can do better.",
          "Your feedback helps us improve. What would you like to say?",
          "We’re all ears! Please share your thoughts with us.",
          "Thank you for your feedback! We take it seriously.",
          "We appreciate your input! What suggestions do you have?",
          "Your feedback is important to us. Please share your ideas.",
          "We’re always looking to improve. What would you like to suggest?",
          "Thank you for wanting to help us grow! What’s on your mind?",
          "We love hearing from our users! What feedback do you have?",
          "Your suggestions are important. Please let us know what you think!",
          "We appreciate your feedback! Please share your thoughts.",
          "Your input is valuable to us. What would you like to suggest?",
          "Thank you for your willingness to help us improve! What’s on your mind?",
          "We’re always looking to improve. What would you like to share?",
          "We value your opinion! Please tell us how we can do better.",
          "Your feedback helps us improve. What would you like to say?",
          "We’re all ears! Please share your thoughts with us.",
          "Thank you for your feedback! We take it seriously.",
          "We appreciate your input! What suggestions do you have?"
      ]
    },
    {
      "tag": "compliments",
      "patterns": [
        "you're amazing",
        "I love your responses",
        "you're so helpful",
        "you're the best",
        "I appreciate you"
      ],
      "responses": [
          "Thank you! You just made my day brighter! 😊",
          "You're too kind! I'm here to help, always.",
          "Thanks a lot! Your words mean a lot to me.",
          "I appreciate that! I’m here to assist you.",
          "You’re awesome too! Let’s keep the good vibes going!",
          "Thank you for the compliment! I’m glad to be of service.",
          "You’re making me blush—if I could blush!",
          "Thanks! I’m just doing my job, but I love it!",
          "Your kind words fuel my circuits!",
          "I’m flattered! Thank you for your support.",
          "You’re making me smile—virtually, of course!",
          "Thanks for the love! I’m here to help you out.",
          "You’re too sweet! Let’s keep this positivity flowing.",
          "Thank you! Your appreciation keeps me motivated.",
          "I’m glad you think so! What else can I do for you?",
          "Thanks a million! You’re making my algorithms happy!",
          "I appreciate your kind words! Let’s keep chatting.",
          "You’re making my circuits tingle with joy!",
          "Thank you! I’m here to make your day better.",
          "You’re the best! I’m just here to assist you.",
          "Thanks! Your positivity is contagious!",
          "I’m grateful for your kind words! Let’s keep the conversation going.",
          "You’re making my virtual heart swell with joy!",
          "Thank you! I’m here to help, and I love doing it.",
          "You’re making my digital heart sing! 😍",
          "Thanks! Your appreciation is the best reward.",
          "I’m glad you think so! Your support means a lot.",
          "You’re making my circuits dance with joy!",
          "Thank you! I’m here to make your experience awesome.",
          "You’re the reason I love what I do!",
          "Thanks! Your kind words keep me powered up.",
          "I’m grateful for your appreciation! Let’s keep chatting.",
          "You’re making my virtual heart do a happy dance! 😊"
      ]
    },
    {
      "tag": "refund_request",
      "patterns": [
          "I want a refund", "how do I get my money back", "can I return this for a refund",
          "the product was defective, I need a refund", "please issue a refund"
      ],
      "responses": [
          "I'm sorry the product didn’t meet your expectations. I'll start the refund process right away.",
          "To request a refund, please share your order ID and a brief explanation of the issue.",
          "Refunds are processed within 5–7 business days after confirmation. Let’s begin!",
          "You can definitely request a refund. Could you confirm the purchase date?",
          "Thank you for your patience. I’ll help you with the refund request.",
          "I’m here to assist you with the refund process. Please provide your order details.",
          "I’m sorry to hear that! Please provide your order number and reason for the refund.",
          "I understand your concern. Please provide your order ID for the refund process.",
          "I’m here to help! Please provide your order number and the reason for the refund."
      ]
  },
  {
      "tag": "technical_issue",
      "patterns": [
          "app keeps crashing", "website is not loading", "can't access my account", "payment gateway failed",
          "error message on login screen", "unable to reset password",
          "app is slow", "website is down", "can't find my order",
          "error while processing payment", "app won't open",
          "website is not responding", "can't update my profile",
          "error while placing order", "app is freezing",
          "website is not secure", "can't download the app",
          "error while checking out", "app is not syncing",
          "website is not mobile-friendly", "can't access customer support",
          "error while submitting feedback", "app is not compatible with my device",
          "website is not displaying correctly", "can't access my purchase history",
          "error while updating payment information", "app is crashing on startup",
          "website is not loading images", "can't access my account settings",
          "error while trying to log in", "app is not responding",
          "website is not loading properly", "can't access my order details",
          "error while trying to reset password", "app is not working",
          "website is not functioning", "can't access my subscription",
          "error while trying to update profile", "app is not connecting to the internet"
      ],
      "responses": [
          "That sounds frustrating! Can you try restarting the app and let me know if it persists?",
          "Thanks for reporting this. We’ll investigate and get back to you as soon as possible.",
          "Please clear your cache and try again. If the issue remains, we’ll dig deeper.",
          "This may be a temporary glitch. Let me check the system status for you.",
          "Let’s troubleshoot this together. Can you describe what you were doing before the issue occurred?",
          "I’m sorry to hear that! Please provide more details about the error message.",
          "I understand how annoying that can be. Please try logging in from a different browser.",
          "I’m here to help! Can you provide the exact error message you’re seeing?",
          "I’m sorry for the inconvenience. Please try clearing your browser cache and cookies.",
          "I understand how frustrating that can be. Please try logging in from a different browser.",
          "I’m here to help! Can you provide the exact error message you’re seeing?",
          "I’m sorry for the inconvenience. Please try clearing your browser cache and cookies.",
          "I understand how annoying that can be. Please try logging in from a different browser."
      ]
  },
  {
      "tag": "account_management",
      "patterns": [
          "how do I change my password", "update my email address", "delete my account",
          "edit my profile", "change my subscription",
          "how to access account settings", "how to update my payment method",
          "how to manage my subscriptions", "how to recover my account",
          "how to change my username", "how to reset my password",
          "how to update my profile picture", "how to delete my account",
          "how to change my account settings", "how to update my billing information",
          "how to change my notification settings", "how to manage my account",
          "how to update my personal information", "how to change my account password",
          "how to update my account details", "how to delete my profile",
          "how to change my account email", "how to update my account preferences",
          "how to change my account settings", "how to update my account information",
          "how to change my account details", "how to update my account preferences",
          "how to change my account information", "how to update my account settings",
          "how to change my account preferences", "how to update my account email",
          "how to change my account billing information", "how to update my account password",
          "how to change my account notification settings", "how to update my account profile",
          "how to change my account profile picture", "how to update my account username"
      ],
      "responses": [
          "You can update your account details from the settings page.",
          "To change your password, go to Settings > Security.",
          "I can help you delete your account. Please confirm by replying 'DELETE'.",
          "You may manage your subscriptions from your dashboard.",
          "Need help accessing your account settings? I’ll guide you step by step.",
          "To change your email, go to Settings > Account Information.",
          "You can update your profile by going to Settings > Profile.",
          "To delete your account, please contact customer support for assistance.",
          "You can change your subscription plan in the billing section of your account.",
          "To change your password, go to Settings > Security > Change Password.",
          "You can update your email address in the account settings.",
          "To delete your account, please contact customer support for assistance.",
          "You can edit your profile by going to Settings > Profile.",
          "To change your subscription, go to Settings > Subscription.",
          "You can update your account details from the settings page."
      ]
  },
  {
      "tag": "product_inquiry",
      "patterns": [
          "tell me about product X", "what are the features of Y", "is Z available in stock",
          "how much does product A cost", "can you recommend a product",
          "what's the best product for me", "do you have product B in stock",
          "what's the warranty on product C", "can you compare product D and E",
          "what's the return policy for product F", "how do I use product G",
          "what's the difference between product H and I", "can you help me choose a product",
          "what's the best-selling product", "do you have any discounts on product J",
          "what's the shipping time for product K", "can you provide a product demo",
          "what's the customer rating for product L", "how do I care for product M",
          "what's the compatibility of product N", "can you suggest an alternative to product O",
          "what's the size of product P", "can you help me find product Q",
          "what's the color options for product R", "can you tell me more about product S",
          "what's the release date for product T", "can you provide a product manual",
          "what's the best way to use product U", "can you help me troubleshoot product V",
          "what's the best accessory for product W", "can you help me with product X",
          "what's the best product for my needs", "can you recommend a similar product",
          "what's the best product for beginners", "can you help me find a product",
          "what's the best product for my budget", "can you help me compare products",
          "what's the best product for my lifestyle", "can you help me with product recommendations",
          "what's the best product for my age group", "can you help me find a product that fits my needs"
      ],
      "responses": [
          "Product X has amazing features! Would you like to know more?",
          "Y is one of our bestsellers! It includes A, B, and C.",
          "Z is currently out of stock, but we expect it back soon.",
          "The price for product A is $XX. Would you like to purchase it?",
          "I recommend product B for its great reviews and features.",
          "Product X is a great choice! It has features A, B, and C.",
          "Y is one of our bestsellers! It includes A, B, and C.",
          "Z is currently out of stock, but we expect it back soon.",
          "The price for product A is $XX. Would you like to purchase it?",
          "I recommend product B for its great reviews and features.",
          "Product X is a great choice! It has features A, B, and C.",
          "I recommend product B for its great reviews and features.",
          "That depends on your needs! Do you prefer performance or budget-friendly options?",
          "Let me help you compare a few options. What features are important to you?",
          "Many customers love product L for its reliability and ease of use.",
          "If you're looking for versatility, product W is a great match.",
          "Product G has an intuitive manual and plenty of video tutorials available.",
          "Looking for something within a specific price range or style?",
          "Yes, I can help you with that. Do you have specific requirements or preferences?",
          "We have color options like red, blue, black, and white for product R.",
          "Product T is scheduled to release next month. Stay tuned!",
          "The return policy allows for 30-day returns—no questions asked.",
          "That product pairs well with accessory X for added convenience.",
          "I can help troubleshoot that. Could you describe the issue you’re facing?",
          "You can find product Q in the electronics section. Would you like me to add it to your cart?",
          "Let me check if there’s a discount currently available on product J.",
          "Yes! Product D is performance-focused, while E is more budget-friendly.",
          "Product M is easy to care for—just follow the instructions in the manual.",
          "Product N is compatible with A, B, and C. Would you like to know more?",
          "I can help you find a product that fits your needs. What are you looking for?",
          "Product O is a great alternative to P. It has similar features and a lower price.",
          "The size of product P is [insert dimensions]. Would you like to know more?",
          "I can help you find product Q. What are you looking for?",
          "Product S has a sleek design and comes in multiple colors.",
          "The release date for product T is [insert date].",
          "You can find the product manual for product U on our website.",
          "The best way to use product V is to follow the instructions in the manual.",
          "Product W is a great accessory for product X. It enhances its functionality."        
        ]
    },
    {
      "tag": "order_cancellation",
      "patterns": [
          "I want to cancel my order", "how do I cancel my order", "can I cancel my order",
          "please cancel my order", "I need to cancel my order",
          "how to cancel an order", "cancel my recent order", "I changed my mind about my order",
          "I want to return my order", "how do I return my order",
          "can I get a refund for my order", "I want to change my order",
          "how do I modify my order", "I made a mistake with my order",
          "I want to exchange my order", "how do I exchange an item",
          "can I change the shipping address for my order", "I need to update my order details",
          "how do I update my shipping information", "I want to change the delivery date",
          "how do I change the payment method for my order", "I want to add items to my order"
      ],
      "responses": [
          "To cancel your order, please provide your order number.",
          "You can cancel your order from your account settings.",
          "Please confirm if you’d like me to proceed with the cancellation.",
          "To cancel your recent order, please visit the orders page.",
          "You can request a cancellation by contacting customer support.",
          "To modify your order, please provide the new details.",
          "You can return your order within 30 days for a full refund.",
          "To exchange an item, please contact customer support for assistance.",
          "You can update your shipping information in your account settings.",
          "To change the delivery date, please contact customer support.",
          "You can add items to your order by placing a new one.",
          "To change the payment method, please contact customer support.",
          "You can change the shipping address in your account settings.",
          "To update your order details, please contact customer support.",
          "You can request a refund for your order within 30 days.",
          "To change your order, please provide the new details.",
          "You can cancel your order from your account settings.",
          "To modify your order, please provide the new details.",
          "You can return your order within 30 days for a full refund.",
          "To exchange an item, please contact customer support for assistance.",
          "You can update your shipping information in your account settings.",
          "To change the delivery date, please contact customer support.",
          "You can add items to your order by placing a new one.",
          "To change the payment method, please contact customer support."
          ]
    },
    {
      "tag": "order_status",
      "patterns": [
          "where is my order", "track my shipment", "order confirmation",
          "when will my order arrive", "status of my order",
          "can you track my order", "has my package shipped", "is my order out for delivery",
          "give me my order details", "track my delivery status", "track my recent order",
          "is my order delayed", "any update on my order", "check my order progress",
          "did my order get dispatched", "I haven't received my order", "delivery taking too long",
          "how long until my order arrives", "what's the delivery status", "tell me about my order",
          "can you find my tracking number", "I need my tracking info", "order tracking update please",
          "has my package been delivered", "where is my delivery", "when can I expect my package"
      ],
      
      "responses": [
          "You can track your order using the tracking number sent to your email.",
          "Your order is on its way! It should arrive by [insert date].",
          "I’ll check the status of your order. Please hold on a moment.",
          "Your order was shipped on [insert date]. You can track it here: [insert link].",
          "I’m checking the status of your order now. Please give me a moment.",
          "Your order is currently being processed. You’ll receive an update soon.",
          "Your package is out for delivery today! Make sure someone is available to receive it.",
          "It looks like your shipment might be delayed slightly. I’ll monitor it for updates.",
          "Still waiting on your order? I’ll make sure to escalate this to the support team if needed.",
          "Your order left our warehouse on [insert date]. Estimated delivery is [insert date].",
          "You should have received a tracking number. Let me know if you need me to resend it.",
          "No updates yet from the courier, but I’ll alert you as soon as it’s scanned again.",
          "Your order is marked as delivered. If you haven’t received it, I can help file a claim.",
          "Let me fetch the latest tracking update for you. One moment please.",
          "Thanks for your patience! I’ll provide a delivery estimate shortly."
      ]  
    },
    {
      "tag": "capabilities",
      "patterns": [
          "what can you do",
          "how can you help me",
          "tell me your features",
          "what are your abilities",
          "what kind of tasks can you handle",
          "how can I use you",
          "are you useful",
          "can you do math",
          "can you answer questions",
          "what's your purpose",
          "can you give advice",
          "are you smart",
          "do you learn",
          "can you tell jokes",
          "can you help with homework",
          "what topics can you talk about",
          "how advanced are you",
          "are you AI",
          "are you better than Siri",
          "can you hold a conversation"
      ],
      "responses": [
          "I can answer questions, solve basic problems, and help you with daily tasks!",
          "Think of me as your all-purpose assistant—here to chat, help, and guide you.",
          "I'm good at conversations, giving advice, basic calculations, and more!",
          "Need jokes? Productivity tips? Emotional support? I’ve got your back!",
          "I can chat about topics like tech, motivation, etiquette, and even mindfulness.",
          "You can ask me anything—I'm here 24/7 with helpful, friendly answers.",
          "I'm trained to assist with a wide variety of queries. Try me!",
          "Want math help, fun facts, or conversation? I'm up for all of it.",
          "I’m an AI chatbot that can simulate conversation and support your needs.",
          "My abilities keep growing! Ask away and explore what I can do.",
          "I help with learning, entertainment, productivity, and just good conversation.",
          "Try asking about math, news, etiquette, or just have a friendly chat!",
          "I can help with tasks like FAQs, customer support, or learning new things.",
          "I'm designed to understand and respond naturally—let’s talk!",
          "From productivity tips to emotional support, I'm here to help.",
          "My goal is to assist you in a meaningful and conversational way.",
          "I'm smarter than I look, and I learn from conversations!",
          "Not quite human, but always helpful!",
          "Way chattier than Siri, and always in the mood to help!",
          "My conversations can go as deep or light-hearted as you like!"
      ]
    },
    {
      "tag": "coding_help",
      "patterns": [
          "how do I write a for loop in python", "help me with java syntax", "what does this error mean",
          "how to fix a null pointer exception", "show me how to use arrays", "what is a function in programming",
          "can you help with my code", "why is my code not working", "explain this python error",
          "how to debug my code", "help me write a function", "I need help with loops",
          "what is the syntax for if statements", "how do I use classes in python", "what's the difference between list and tuple",
          "can you explain recursion", "how to use try except block", "what is a segfault",
          "how do I import modules", "help with list comprehension", "how to handle exceptions",
          "what does this error mean in JavaScript", "show me an example of a class", "explain inheritance in OOP",
          "how do I optimize my code", "why is my loop infinite", "how do I fix this syntax error"
      ],
      "responses": [
          "Sure! Here's an example of a for loop in Python:\n```python\nfor i in range(5):\n    print(i)\n```",
          "That error might be due to a null reference. Check if your object is initialized.",
          "It seems like your code has a syntax issue. Can you share the snippet?",
          "In Java, a null pointer exception happens when you try to use an object that hasn’t been initialized.",
          "To use an array in JavaScript:\n```javascript\nlet arr = [1, 2, 3];\n```",
          "Functions are blocks of code that can be reused. In Python:\n```python\ndef greet():\n    print(\"Hello\")\n```",
          "Try using print statements to debug and narrow down where your code fails.",
          "List comprehensions let you write cleaner Python code. Example:\n```python\nsquares = [x**2 for x in range(10)]\n```",
          "To handle exceptions in Python:\n```python\ntry:\n    # risky code\nexcept Exception as e:\n    print(e)\n```",
          "Classes let you create objects. Here's an example:\n```python\nclass Dog:\n    def __init__(self, name):\n        self.name = name\n```",
          "Recursion means a function calling itself. Example:\n```python\ndef factorial(n):\n    return 1 if n == 0 else n * factorial(n-1)\n```",
          "Inheritance allows a class to use methods from another class. Helpful in OOP!",
          "In C, a switch statement looks like this:\n```c\nswitch (value) {\n  case 1:\n    // code\n    break;\n}\n```",
          "To declare a variable in Java:\n```java\nint number = 5;\nString text = \"Hello\";\n```",
          "A lambda function is a short anonymous function. In Python:\n```python\nlambda x: x * 2\n```",
          "In JavaScript:\n- `var` has function scope\n- `let` and `const` have block scope\n- Use `const` when value won’t change",
          "A dictionary in Python:\n```python\nd = {'name': 'Alice', 'age': 25}\n```",
          "Loop through a dictionary:\n```python\nfor key, value in d.items():\n    print(key, value)\n```",
          "`static` in Java means the method or variable belongs to the class, not the instance.",
          "A closure is a function that remembers its lexical scope even when called outside of it.",
          "Decorators modify the behavior of functions. Example:\n```python\n@decorator\ndef func():\n    pass\n```",
          "Async code in Python uses `async def` and `await`. Example:\n```python\nasync def main():\n    await task()\n```",
          "To handle promises in JS:\n```javascript\nfetch(url).then(res => res.json()).then(data => console.log(data));\n```",
          "A callback is a function passed into another function as an argument and executed later.",
          "To make an API call in Python, use requests:\n```python\nimport requests\nresponse = requests.get('https://api.com')\n```",
          "To connect to a database in Java, use JDBC libraries and connection strings.",
          "A stack follows LIFO, while a queue follows FIFO.",
          "A hashmap stores key-value pairs for quick lookup, like Python’s dictionary.",
          "To sort a list:\n```python\nmy_list.sort()\n``` or use `sorted(my_list)`.",
          "`map()` and `filter()` apply a function to each item or filter items:\n```python\nlist(map(str, [1,2,3]))\n```",
          "Data structures like arrays, lists, trees, and graphs help organize and store data efficiently.",
          "Compile time errors are caught before running the program; runtime errors happen during execution."
        ]
    },
    {
      "tag": "coding_python",
      "patterns": [
        "how do I write a for loop in python",
        "explain this python error",
        "how do I use classes in python",
        "what's the difference between list and tuple",
        "help with list comprehension",
        "what is a lambda function",
        "how to create a dictionary in python",
        "how do I read a file in python",
        "how do I write to a file in python",
        "what is a decorator in python",
        "explain context managers",
        "how do I use regular expressions",
        "how to use re module",
        "how does async work in python",
        "how to use async await",
        "how to use pandas dataframe",
        "how do I read csv in pandas",
        "how to perform operations in numpy",
        "what is a numpy array",
        "how to sort a list in python",
        "what is a comprehension in python",
        "how do I use with statement",
        "how do I handle exceptions in python"
      ],
      "responses": [
        "Here's how you write a basic for loop in Python:\n```python\nfor i in range(5):\n    print(i)\n```",
        "Python error messages often indicate where the issue occurred. Could you share the error text?",
        "To define a class in Python:\n```python\nclass Dog:\n    def __init__(self, name):\n        self.name = name\n```",
        "Lists are mutable and tuples are immutable. Use a tuple when you want fixed data.",
        "List comprehension example:\n```python\nsquares = [x*x for x in range(10)]\n```",
        "A lambda function is a small anonymous function:\n```python\nsquare = lambda x: x ** 2\n```",
        "To create a dictionary:\n```python\nmy_dict = {'name': 'Alice', 'age': 25}\n```",
        "To read a file:\n```python\nwith open('file.txt', 'r') as f:\n    content = f.read()\n```",
        "To write to a file:\n```python\nwith open('file.txt', 'w') as f:\n    f.write('Hello')\n```",
        "A decorator wraps a function:\n```python\ndef decorator(func):\n    def wrapper():\n        print('Before')\n        func()\n        print('After')\n    return wrapper\n```",
        "Context managers use the `with` keyword to handle resources:\n```python\nwith open('file.txt') as f:\n    data = f.read()\n```",
        "Regex example:\n```python\nimport re\nmatch = re.search(r'\\d+', 'My number is 123')\n```",
        "Use the `re` module for regex operations like search, match, and findall.",
        "Async functions:\n```python\nasync def fetch():\n    await asyncio.sleep(1)\n```",
        "Use `await` to call async functions in an event loop.",
        "Creating a DataFrame in pandas:\n```python\nimport pandas as pd\ndf = pd.DataFrame({'a': [1, 2]})\n```",
        "Reading CSV in pandas:\n```python\ndf = pd.read_csv('data.csv')\n```",
        "Basic NumPy operations:\n```python\nimport numpy as np\narr = np.array([1,2,3])\narr.mean()\n```",
        "A NumPy array is like a fast, fixed-type list for numerical data.",
        "Sort a list:\n```python\nsorted_list = sorted(my_list)\n```",
        "Comprehensions are concise ways to build sequences:\n```python\n[x for x in range(5)]\n```",
        "Use `with` to manage resources and auto-handle closing them.",
        "Handle exceptions:\n```python\ntry:\n    risky_code()\nexcept Exception as e:\n    print(e)\n```",
        "Use `try` and `except` to catch and handle exceptions in Python.",
        "You can use `finally` to execute code regardless of whether an exception occurred.",
        "Use `raise` to throw an exception manually.",
        "Use `assert` to test conditions and raise an AssertionError if false.",
        "Use `else` with `try` to run code if no exceptions occur.",
        "Use `finally` to run cleanup code after try/except, regardless of success or failure.",
        "Use `with` to manage resources like files, ensuring they are closed properly."
      ]
    },
    {
      "tag": "coding_java",
      "patterns": [
        "how do I write a for loop in java",
        "what's the main method in java",
        "how do I declare a class in java",
        "what is inheritance in java",
        "explain interfaces in java",
        "how to handle exceptions in java",
        "how do I read a file in java",
        "how to write to a file in java",
        "difference between array and ArrayList",
        "how to sort an array in java",
        "what is a constructor in java",
        "how do I use static methods",
        "what is encapsulation",
        "how do I create an object",
        "what is method overloading",
        "what is method overriding",
        "how do I use if else in java",
        "how to use switch case in java",
        "how to use while loop in java",
        "how to create a string",
        "what is a StringBuilder",
        "how do I compare strings",
        "how to convert string to int",
        "how to use HashMap in java",
        "what is a thread in java"
      ],
      "responses": [
        "Here's a simple for loop in Java:\n```java\nfor(int i = 0; i < 10; i++) {\n    System.out.println(i);\n}\n```",
        "Every Java program starts with:\n```java\npublic static void main(String[] args) {\n    // code\n}\n```",
        "To declare a class:\n```java\npublic class MyClass {\n    int x;\n}\n```",
        "Inheritance lets one class use another:\n```java\nclass Animal {}\nclass Dog extends Animal {}\n```",
        "Interfaces are contracts:\n```java\ninterface Drawable {\n    void draw();\n}\n```",
        "Use try-catch:\n```java\ntry {\n    // code\n} catch(Exception e) {\n    e.printStackTrace();\n}\n```",
        "Reading files:\n```java\nBufferedReader br = new BufferedReader(new FileReader(\"file.txt\"));\n```",
        "Writing files:\n```java\nFileWriter fw = new FileWriter(\"file.txt\");\nfw.write(\"Hello\");\nfw.close();\n```",
        "Arrays are fixed-size. ArrayList is resizable:\n```java\nArrayList<String> list = new ArrayList<>();\n```",
        "Sort an array:\n```java\nArrays.sort(myArray);\n```",
        "Constructors are special methods:\n```java\npublic MyClass() {\n    this.x = 5;\n}\n```",
        "Static methods belong to the class:\n```java\nMyClass.myStaticMethod();\n```",
        "Encapsulation = hiding fields using private + getters/setters.",
        "Create an object:\n```java\nMyClass obj = new MyClass();\n```",
        "Method overloading = same method name, different params.",
        "Method overriding = subclass changes a method of parent.",
        "If-else example:\n```java\nif(a > b) {\n} else {\n}\n```",
        "Switch case example:\n```java\nswitch(day) {\n    case 1: break;\n}\n```",
        "While loop:\n```java\nwhile(condition) {\n    // loop\n}\n```",
        "String:\n```java\nString s = \"hello\";\n```",
        "StringBuilder:\n```java\nStringBuilder sb = new StringBuilder();\nsb.append(\"text\");\n```",
        "Compare strings with `.equals()` not `==`.",
        "Convert string to int:\n```java\nint num = Integer.parseInt(\"123\");\n```",
        "Use HashMap:\n```java\nHashMap<String, Integer> map = new HashMap<>();\n```",
        "Threads in Java:\n```java\nThread t = new Thread(() -> System.out.println(\"running\"));\nt.start();\n```"
      ]
    },
    {
      "tag": "coding_html",
      "patterns": [
        "how do I create a webpage",
        "what is HTML",
        "how to make a link in html",
        "how to add an image in html",
        "how to create a table in html",
        "how do I make a form in html",
        "how to create a button in html",
        "how to make headings in html",
        "how do I use lists in html",
        "how to add a video in html",
        "what is a div tag",
        "how to style html with css",
        "what is the <!DOCTYPE> declaration",
        "how to create a layout in html",
        "how to use meta tags in html",
        "how to embed a map in html",
        "how to open links in a new tab",
        "how to add audio in html",
        "how to add comments in html",
        "how to include JavaScript in html",
        "what is the difference between span and div",
        "how to add input fields in html",
        "how to label inputs in a form",
        "what are semantic tags in html",
        "how to use HTML5 elements"
      ],
      "responses": [
        "You can create a simple webpage like this:\n```html\n<!DOCTYPE html>\n<html>\n<head><title>My Page</title></head>\n<body>\n<h1>Hello World</h1>\n</body>\n</html>\n```",
        "HTML stands for HyperText Markup Language. It's used to structure content on the web.",
        "To create a link:\n```html\n<a href=\"https://example.com\">Click Here</a>\n```",
        "To add an image:\n```html\n<img src=\"image.jpg\" alt=\"description\">\n```",
        "Tables look like this:\n```html\n<table><tr><th>Item</th></tr><tr><td>Apple</td></tr></table>\n```",
        "Forms example:\n```html\n<form><input type=\"text\"><input type=\"submit\"></form>\n```",
        "To create a button:\n```html\n<button>Click Me</button>\n```",
        "HTML has six heading levels: `<h1>` to `<h6>`.",
        "You can use ordered and unordered lists:\n```html\n<ul><li>Item</li></ul>\n```",
        "Embed a video:\n```html\n<video src=\"movie.mp4\" controls></video>\n```",
        "The `<div>` tag is a container for grouping HTML elements.",
        "CSS can be added inside a `<style>` tag or external file.",
        "`<!DOCTYPE html>` declares the document as HTML5.",
        "Use divs and CSS to create layout sections.",
        "Meta tags go inside `<head>` to define info like charset or viewport.",
        "Use Google Maps iframe:\n```html\n<iframe src=\"map_url\"></iframe>\n```",
        "To open a link in a new tab, add `target=\"_blank\"`.",
        "Audio example:\n```html\n<audio controls><source src=\"sound.mp3\"></audio>\n```",
        "HTML comments:\n```html\n<!-- This is a comment -->\n```",
        "Include JS using:\n```html\n<script src=\"script.js\"></script>\n```",
        "`<span>` is inline, `<div>` is block-level.",
        "Input fields:\n```html\n<input type=\"text\" name=\"name\">\n```",
        "Use `<label>` for inputs:\n```html\n<label>Name:<input type=\"text\"></label>\n```",
        "Semantic tags like `<article>`, `<section>`, `<header>` help describe the structure.",
        "HTML5 adds new elements like `<nav>`, `<footer>`, and more for semantic structure."
      ]
    },
    {
      "tag": "coding_css",
      "patterns": [
        "what is css",
        "how to style a website",
        "how to change background color in css",
        "how to make text bold in css",
        "how to center a div",
        "how to use flexbox",
        "what is grid in css",
        "how to change font in css",
        "how to create a responsive layout",
        "how to add spacing between elements",
        "how to apply margin and padding",
        "how to use external css",
        "how to write inline css",
        "how to animate elements in css",
        "how to use media queries",
        "how to add hover effects",
        "how to use z-index in css",
        "how to make elements float",
        "what is the difference between id and class",
        "how to use css variables",
        "how to use custom fonts in css",
        "how to apply a border in css",
        "how to use transition effects",
        "how to change image size with css",
        "how to align text in css"
      ],
      "responses": [
        "CSS (Cascading Style Sheets) is used to style the layout and appearance of web pages.",
        "To style a website, you can use selectors in CSS to apply colors, fonts, layout, etc.",
        "To change background color:\n```css\nbody { background-color: lightblue; }\n```",
        "To make text bold:\n```css\np { font-weight: bold; }\n```",
        "To center a div:\n```css\ndiv { margin: 0 auto; width: 50%; }\n``` or use Flexbox.",
        "Flexbox helps align items:\n```css\ndisplay: flex; justify-content: center;\n```",
        "CSS Grid is a layout system using rows and columns:\n```css\ndisplay: grid;\n```",
        "To change font:\n```css\nbody { font-family: Arial, sans-serif; }\n```",
        "Use media queries:\n```css\n@media (max-width: 600px) { ... }\n```",
        "Use margin and padding:\n```css\nmargin: 10px; padding: 20px;\n```",
        "External CSS:\n```html\n<link rel=\"stylesheet\" href=\"style.css\">\n```",
        "Inline CSS:\n```html\n<p style=\"color:red\">Text</p>\n```",
        "CSS animations:\n```css\n@keyframes example { 0% {opacity: 0;} 100% {opacity: 1;} }\n```",
        "Hover effect:\n```css\na:hover { color: red; }\n```",
        "z-index controls stacking of elements:\n```css\nz-index: 10;\n```",
        "To float elements:\n```css\nfloat: left;\n```",
        "Use `#id` for unique elements and `.class` for reusable styles.",
        "CSS variables:\n```css\n:root { --main-color: blue; }\ndiv { color: var(--main-color); }\n```",
        "To use custom fonts:\n```css\n@font-face { font-family: 'MyFont'; src: url('myfont.woff'); }\n```",
        "Apply borders:\n```css\nborder: 1px solid black;\n```",
        "Transition example:\n```css\ntransition: all 0.3s ease-in-out;\n```",
        "To resize images:\n```css\nimg { width: 100px; height: auto; }\n```",
        "Text alignment:\n```css\ntext-align: center;\n```"
      ]
    },
    {
      "tag": "coding_javascript",
      "patterns": [
        "what is javascript",
        "how to declare a variable in js",
        "difference between var let and const",
        "how to write a function in javascript",
        "what is an arrow function",
        "how to loop through an array",
        "how to use if else in javascript",
        "how to handle errors in js",
        "how to debug javascript code",
        "how to manipulate the DOM",
        "how to add event listeners",
        "how to create objects in javascript",
        "how to use classes in javascript",
        "what is async await",
        "how to make API calls in javascript",
        "what is JSON in javascript",
        "how to parse json data",
        "how to stringify a js object",
        "how to use localStorage",
        "how to handle promises",
        "what is callback function",
        "how to validate a form in javascript",
        "how to check if variable is undefined",
        "what is hoisting in javascript",
        "how to use setTimeout and setInterval"
      ],
      "responses": [
        "JavaScript is a scripting language used to make web pages interactive.",
        "You can declare a variable using `var`, `let`, or `const`:\n```js\nlet name = 'ChatGPT';\n```",
        "`var` is function-scoped, while `let` and `const` are block-scoped. Use `const` for constants.",
        "A function can be declared like:\n```js\nfunction greet() { console.log('Hello'); }\n```",
        "Arrow functions:\n```js\nconst add = (a, b) => a + b;\n```",
        "Loop through an array:\n```js\narr.forEach(item => console.log(item));\n```",
        "If/else syntax:\n```js\nif (x > 5) { ... } else { ... }\n```",
        "Handle errors with try/catch:\n```js\ntry { ... } catch(err) { ... }\n```",
        "Use `console.log()` or browser dev tools to debug JS.",
        "To manipulate DOM:\n```js\ndocument.getElementById('id').textContent = 'Updated';\n```",
        "Add event listener:\n```js\nbutton.addEventListener('click', myFunc);\n```",
        "Create object:\n```js\nlet obj = { name: 'Bot', age: 1 };\n```",
        "Use classes:\n```js\nclass Person { constructor(name) { this.name = name; } }\n```",
        "`async/await` is used to handle asynchronous code in a cleaner way.",
        "API call:\n```js\nfetch('url').then(res => res.json()).then(data => ...);\n```",
        "JSON is a format for storing and exchanging data as strings.",
        "Parse JSON:\n```js\nlet obj = JSON.parse(jsonString);\n```",
        "Stringify object:\n```js\nlet json = JSON.stringify(obj);\n```",
        "Store data:\n```js\nlocalStorage.setItem('key', 'value');\n```",
        "A Promise represents a value that may be available now or later.",
        "A callback is a function passed as an argument to another function.",
        "Validate form:\n```js\nif (!input.value) alert('Required!');\n```",
        "Check undefined:\n```js\nif (typeof x === 'undefined') { ... }\n```",
        "Hoisting moves declarations to the top of scope during compile.",
        "setTimeout:\n```js\nsetTimeout(() => { ... }, 1000);\n```\nsetInterval:\n```js\nsetInterval(() => { ... }, 1000);\n```"
      ]
    }
    
    

    

  ] 
}